opendj3-server-dev/tests/staf-tests/functional-tests/shared/data/dsml/suites/03dsmlerrsuite/data/soap_badxmlprolog.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 417
SOAPAction: batchRequest

<?xml version='1.XXXXXXX' encoding='UTF-8'?>
<soap-env:Envelope
   xmlns:xsd='http://www.w3.org/2001/XMLSchema'
   xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
   xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'
   >
<soap-env:Body>
<batchRequest
   xmlns="urn:oasis:names:tc:DSML:2:0:core"
   requestID="Bad XML prolog: version mismatch"
   >
</batchRequest>
</soap-env:Body>
</soap-env:Envelope>
